public class TaskWork01 {
    //Написать первую программу, которая выводит в консоль строку “Hello World!”
    public static void main(String[] args) {
        System.out.println("Hello World!");
    }
}